newwms_gift/src/DataProcessors/ФормированиеДанныхСветофора/ФормированиеДанныхСветофора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеДанныхСветофора</name>
</mdclass:DataProcessor>

newwms_gift/src/InformationRegisters/итWMSЗадачиТСД/итWMSЗадачиТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSЗадачиТСД</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТСД</name>
    <type>
      <types>CatalogRef.итWMSСправочникТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.итWMSКонтрольнаяОперацияАгрегации</types>
      <types>DocumentRef.итWMSРазмещение</types>
      <types>DocumentRef.итWMSЗадачиИнвентаризации</types>
      <types>DocumentRef.итWMSПроверка</types>
      <types>DocumentRef.итWMSНаборка</types>
      <types>DocumentRef.итWMSПеремещение</types>
      <types>DocumentRef.итWMSОтгрузка</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачиРодителя</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/InformationRegisters/итWMSСтрокиЗадачТСД/итWMSСтрокиЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSСтрокиЗадачТСД</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРозлива</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>идСтроки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Enums/итWMSСостоянияЗадачТСД/итWMSСостоянияЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСостоянияЗадачТСД</name>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРазрешения</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Enums/ит_WMS_ВидыСкладскойДеятельности/ит_WMS_ВидыСкладскойДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ит_WMS_ВидыСкладскойДеятельности</name>
  <enumValues>
    <name>Оптовая</name>
  </enumValues>
  <enumValues>
    <name>Розничная</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Набран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеютсяНеЗарезервированныеТовары</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияНаборки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанЛогистом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВНаборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>итВремяНачалаПогрузкиКакВремя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>итВремяЗавершенияПогрузкиКакВремя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <comment>(Упр)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транзит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическойОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СетевойНомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтменитьВсеПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтменитьРезервирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/итWMSНаборка/итWMSНаборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSНаборка</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.СписаниеТоваров</basedOn>
  <basedOn>Document.ВнутреннийЗаказ</basedOn>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозицийНоменклатурыНаПаллете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозицийСерииНаПаллете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервироватьЯчейкиЭстокады</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданНаОснованиСерверногоВызова</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРезервированияБезПеремещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьОшибкиСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаОтправитель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПикинга</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПолучатель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковкиПолучатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтменыЗадачи</name>
      <type>
        <types>CatalogRef.итWMS_ПричиныОтменыЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксацияСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзъятиеТовара</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИзъятия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/DataProcessors/ФормированиеДанныхСветофора/ObjectModule.bsl
Процедура СформироватьТабличныйДокументСветофораНаборка(ТабличныйДокумент)  Экспорт 
	
	Цвет=1;		
	ДатаТекущая=ТекущаяДата();
	ДатаНачала=ДатаТекущая-24*60*60;
	ДатаОкончания=ДатаТекущая+24*60*60;
	
	Значение=итWMSПривилегированныйМодуль.ЗагрузитьНастройкиИзХранилищаОбщихНастроек("итWMSМотивационныйОтчет","итWMSМотивационныйОтчет","итWMSМотивационныйОтчет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ЗаказПокупателя.ДатаОтгрузки, ЧАС, ЧАС(ЗаказПокупателя.итВремяНачалаПогрузкиКакВремя)), МИНУТА, МИНУТА(ЗаказПокупателя.итВремяНачалаПогрузкиКакВремя)) КАК ДатаОтгрузки
	|ПОМЕСТИТЬ ВтДанныеЗаказов
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен
	|	И ЗаказПокупателя.ДатаОтгрузки МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ЗаказПокупателя.Набран
	|	И ЗаказПокупателя.Выполнен
	|	И ЗаказПокупателя.итВремяНачалаПогрузкиКакВремя <> ЗаказПокупателя.итВремяЗавершенияПогрузкиКакВремя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанныеЗаказов.Ссылка КАК Ссылка,
	|	ВтДанныеЗаказов.ДатаОтгрузки КАК ДатаОтгрузки,
	|	итWMSНаборка.Ссылка КАК Наборка
	|ПОМЕСТИТЬ ВтДанныеНаборок
	|ИЗ
	|	ВтДанныеЗаказов КАК ВтДанныеЗаказов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итWMSНаборка КАК итWMSНаборка
	|		ПО ВтДанныеЗаказов.Ссылка = итWMSНаборка.итОснование
	|			И (итWMSНаборка.Проведен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итWMSСтрокиЗадачТСД.идСтроки КАК идСтроки,
	|	ВложенныйЗапрос.ДокументОснование КАК ДокументОснование,
	|	ВложенныйЗапрос.ИдЗадачи КАК ИдЗадачи,
	|	ВложенныйЗапрос.Состояние КАК Состояние
	|ПОМЕСТИТЬ РеальноеСостояниеЗадачДокумента
	|ИЗ
	|	(ВЫБРАТЬ
	|		итWMSЗадачиТСД.ДокументОснование КАК ДокументОснование,
	|		итWMSЗадачиТСД.ИдЗадачи КАК ИдЗадачи,
	|		итWMSЗадачиТСД.Состояние КАК Состояние
	|	ИЗ
	|		ВтДанныеНаборок КАК ВтДанныеНаборок
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSЗадачиТСД КАК итWMSЗадачиТСД
	|			ПО ВтДанныеНаборок.Наборка = итWMSЗадачиТСД.ДокументОснование
	|	
	|	СГРУППИРОВАТЬ ПО
	|		итWMSЗадачиТСД.ДокументОснование,
	|		итWMSЗадачиТСД.ИдЗадачи,
	|		итWMSЗадачиТСД.Состояние) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSСтрокиЗадачТСД КАК итWMSСтрокиЗадачТСД
	|		ПО ВложенныйЗапрос.ИдЗадачи = итWMSСтрокиЗадачТСД.ИдЗадачи
	|
	|СГРУППИРОВАТЬ ПО
	|	итWMSСтрокиЗадачТСД.идСтроки,
	|	ВложенныйЗапрос.ДокументОснование,
	|	ВложенныйЗапрос.ИдЗадачи,
	|	ВложенныйЗапрос.Состояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итWMSНаборкаТовары.Ссылка КАК ДокументОснование,
	|	итWMSНаборкаТовары.Номенклатура КАК Номенклатура,
	|	итWMSНаборкаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	итWMSНаборкаТовары.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	итWMSНаборкаТовары.СерияНоменклатуры.итПризнакПомарочногоУчета КАК итПризнакПомарочногоУчета,
	|	итWMSНаборкаТовары.ЯчейкаПикинга КАК ЯчейкаПикинга,
	|	СУММА(итWMSНаборкаТовары.КоличествоФакт) КАК КоличествоФакт,
	|	МАКСИМУМ(итWMSНаборкаТовары.Номенклатура.ЕдиницаХраненияОстатков.итКоличествоНаПаллете) КАК КоличествоНаПаллете,
	|	МАКСИМУМ(итWMSНаборкаТовары.Номенклатура.ЕдиницаХраненияОстатков.итКоличествоВСлое) КАК КоличествоВСлое,
	|	МАКСИМУМ(итWMSНаборкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент) КАК КоличествоВКоробе,
	|	итWMSНаборкаТовары.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
	|	итWMSНаборкаТовары.Ссылка.Контрагент КАК Контрагент,
	|	итWMSНаборкаТовары.ИдентификаторУпаковкиПолучатель КАК ИдентификаторУпаковкиПолучатель,
	|	итWMSНаборкаТовары.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
	|	итWMSНаборкаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	итWMSНаборкаТовары.Количество КАК Количество,
	|	ВтДанныеНаборок.Ссылка КАК Заказ,
	|	ВтДанныеНаборок.ДатаОтгрузки КАК ДатаОтгрузкиЗаказа
	|ПОМЕСТИТЬ ВтДанныеНаборки
	|ИЗ
	|	ВтДанныеНаборок КАК ВтДанныеНаборок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итWMSНаборка.Товары КАК итWMSНаборкаТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РеальноеСостояниеЗадачДокумента КАК РеальноеСостояниеЗадачДокумента
	|			ПО итWMSНаборкаТовары.ИдентификаторСтроки = РеальноеСостояниеЗадачДокумента.идСтроки
	|				И итWMSНаборкаТовары.Ссылка = РеальноеСостояниеЗадачДокумента.ДокументОснование
	|		ПО ВтДанныеНаборок.Наборка = итWMSНаборкаТовары.Ссылка
	|ГДЕ
	|	итWMSНаборкаТовары.Ссылка.Проведен
	|	И ВЫБОР
	|			КОГДА итWMSНаборкаТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Перечисление.итwmsСтатусыСкладскихдокументов.Зарезервирован)
	|				ТОГДА итWMSНаборкаТовары.СостояниеЗадачи В (ЗНАЧЕНИЕ(Перечисление.итWMSСостоянияЗадачТСД.КВыполнению), ЗНАЧЕНИЕ(Перечисление.итWMSСостоянияЗадачТСД.ПустаяСсылка))
	|			ИНАЧЕ ЕСТЬNULL(РеальноеСостояниеЗадачДокумента.Состояние, итWMSНаборкаТовары.СостояниеЗадачи) В (ЗНАЧЕНИЕ(Перечисление.итWMSСостоянияЗадачТСД.КВыполнению), ЗНАЧЕНИЕ(Перечисление.итWMSСостоянияЗадачТСД.Выполняется))
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	итWMSНаборкаТовары.Номенклатура,
	|	итWMSНаборкаТовары.СерияНоменклатуры,
	|	итWMSНаборкаТовары.ИдентификаторУпаковки,
	|	итWMSНаборкаТовары.СерияНоменклатуры.итПризнакПомарочногоУчета,
	|	итWMSНаборкаТовары.ЯчейкаПикинга,
	|	итWMSНаборкаТовары.ЯчейкаПолучатель,
	|	итWMSНаборкаТовары.Ссылка.Контрагент,
	|	итWMSНаборкаТовары.ИдентификаторУпаковкиПолучатель,
	|	итWMSНаборкаТовары.ЯчейкаОтправитель,
	|	итWMSНаборкаТовары.ИдентификаторСтроки,
	|	итWMSНаборкаТовары.Количество,
	|	итWMSНаборкаТовары.Ссылка,
	|	ВтДанныеНаборок.Ссылка,
	|	ВтДанныеНаборок.ДатаОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанныеНаборки.ДокументОснование КАК ДокументОснование,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтДанныеНаборки.ИдентификаторСтроки) КАК КоличествоСтрок
	|ПОМЕСТИТЬ ВтКоличествоСтрокНаборки
	|ИЗ
	|	ВтДанныеНаборки КАК ВтДанныеНаборки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтДанныеНаборки.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанныеНаборки.ИдентификаторУпаковкиПолучатель КАК ИдентификаторУпаковкиПолучатель,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтДанныеНаборки.ИдентификаторСтроки) КАК КоличествоСтрокПаллеты,
	|	ВтДанныеНаборки.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВтКоличествоСтрокВПаллете
	|ИЗ
	|	ВтДанныеНаборки КАК ВтДанныеНаборки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтДанныеНаборки.ДокументОснование,
	|	ВтДанныеНаборки.ИдентификаторУпаковкиПолучатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ДокументОснование КАК ДокументОснование,
	|	СУММА(ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(ВложенныйЗапрос.КоэффициентПаллетНаборки + 0.4999 КАК ЧИСЛО(15, 0))) < 1
	|				ТОГДА 1
	|			ИНАЧЕ ВЫРАЗИТЬ(ВложенныйЗапрос.КоэффициентПаллетНаборки + 0.4999 КАК ЧИСЛО(15, 0))
	|		КОНЕЦ) КАК КоэффициентПаллетНаборки
	|ПОМЕСТИТЬ КоличествоПаллетНаборкиПоКоэф
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВтДанныеНаборки.ДокументОснование КАК ДокументОснование,
	|		СУММА(ВтДанныеНаборки.Количество / ВЫБОР
	|				КОГДА ЕСТЬNULL(ВтДанныеНаборки.КоличествоНаПаллете, 0) = 0
	|					ТОГДА 1
	|				ИНАЧЕ ЕСТЬNULL(ВтДанныеНаборки.КоличествоНаПаллете, 0)
	|			КОНЕЦ) КАК КоэффициентПаллетНаборки
	|	ИЗ
	|		ВтДанныеНаборки КАК ВтДанныеНаборки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВтДанныеНаборки.ДокументОснование) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтДанныеНаборки.ЯчейкаОтправитель) КАК КоличествоЯчеек,
	|	ВтДанныеНаборки.ДокументОснование КАК ДокументОснование,
	|	ВтДанныеНаборки.ИдентификаторУпаковкиПолучатель КАК ИдентификаторУпаковкиПолучатель
	|ПОМЕСТИТЬ КоличествоЯчеекНаборки
	|ИЗ
	|	ВтДанныеНаборки КАК ВтДанныеНаборки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтДанныеНаборки.ДокументОснование,
	|	ВтДанныеНаборки.ИдентификаторУпаковкиПолучатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	ВложенныйЗапрос.КоличествоНаПаллете КАК КоличествоНаПаллете,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ДокументОснование КАК ДокументОснование,
	|	ВложенныйЗапрос.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
	|	ВложенныйЗапрос.Количество КАК Количество
	|ПОМЕСТИТЬ ИнформацияПоНецелымПаллетымНаборки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВтДанныеНаборки.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|		ВтДанныеНаборки.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
	|		СУММА(ВтДанныеНаборки.Количество) КАК Количество,
	|		МАКСИМУМ(ВтДанныеНаборки.КоличествоНаПаллете) КАК КоличествоНаПаллете,
	|		ВтДанныеНаборки.Номенклатура КАК Номенклатура,
	|		ВтДанныеНаборки.ДокументОснование КАК ДокументОснование
	|	ИЗ
	|		ВтДанныеНаборки КАК ВтДанныеНаборки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВтДанныеНаборки.ИдентификаторУпаковки,
	|		ВтДанныеНаборки.Номенклатура,
	|		ВтДанныеНаборки.ДокументОснование,
	|		ВтДанныеНаборки.ЯчейкаОтправитель) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Количество <> ВложенныйЗапрос.КоличествоНаПаллете
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанныеНаборки.ДокументОснование КАК ДокументОснование,
	|	ВтДанныеНаборки.Номенклатура КАК Номенклатура,
	|	ВтДанныеНаборки.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВтДанныеНаборки.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	ВтДанныеНаборки.итПризнакПомарочногоУчета КАК итПризнакПомарочногоУчета,
	|	ВтДанныеНаборки.КоличествоНаПаллете КАК КоличествоНаПаллете,
	|	ВтДанныеНаборки.КоличествоВСлое КАК КоличествоВСлое,
	|	ВтДанныеНаборки.КоличествоВКоробе КАК КоличествоВКоробе,
	|	ВЫБОР
	|		КОГДА НЕ ИнформацияПоНецелымПаллетымНаборки.ИдентификаторУпаковки ЕСТЬ NULL
	|			ТОГДА ВЫРАЗИТЬ(ВтДанныеНаборки.Количество / ЕСТЬNULL(ВтДанныеНаборки.КоличествоВКоробе, 1) - 0.49999 КАК ЧИСЛО(15, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоВнепаллетныхКоробов,
	|	1 / ВтКоличествоСтрокВПаллете.КоличествоСтрокПаллеты КАК КоэффициентПаллеты,
	|	ВтДанныеНаборки.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
	|	ВтДанныеНаборки.Контрагент КАК Контрагент,
	|	1 / ВтКоличествоСтрокВПаллете.КоличествоСтрокПаллеты КАК КоэффициентЗадачи,
	|	ВЫБОР
	|		КОГДА НЕ ИнформацияПоНецелымПаллетымНаборки.ИдентификаторУпаковки ЕСТЬ NULL
	|			ТОГДА ВЫРАЗИТЬ((ВтДанныеНаборки.Количество / ЕСТЬNULL(ВтДанныеНаборки.КоличествоВКоробе, 1) - (ВЫРАЗИТЬ(ВтДанныеНаборки.Количество / ЕСТЬNULL(ВтДанныеНаборки.КоличествоВКоробе, 1) - 0.49999 КАК ЧИСЛО(15, 0)))) * ВтДанныеНаборки.КоличествоВКоробе + 0.49999 КАК ЧИСЛО(15, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоВнеКоробочныхБутылок,
	|	КоличествоЯчеекНаборки.КоличествоЯчеек КАК КоличествоЯчеекЗадачи,
	|	ВтКоличествоСтрокВПаллете.КоличествоСтрокПаллеты КАК КоличествоСтрокЗадачи,
	|	ВтДанныеНаборки.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
	|	ВтДанныеНаборки.Количество КАК Количество,
	|	ВтДанныеНаборки.ДатаОтгрузкиЗаказа КАК ДатаОтгрузкиЗаказа,
	|	ВтДанныеНаборки.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВтПодготовленныеДанныеНаборки
	|ИЗ
	|	ВтДанныеНаборки КАК ВтДанныеНаборки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИнформацияПоНецелымПаллетымНаборки КАК ИнформацияПоНецелымПаллетымНаборки
	|		ПО ВтДанныеНаборки.ИдентификаторУпаковки = ИнформацияПоНецелымПаллетымНаборки.ИдентификаторУпаковки
	|			И ВтДанныеНаборки.Номенклатура = ИнформацияПоНецелымПаллетымНаборки.Номенклатура
	|			И ВтДанныеНаборки.ДокументОснование = ИнформацияПоНецелымПаллетымНаборки.ДокументОснование
	|			И ВтДанныеНаборки.ЯчейкаОтправитель = ИнформацияПоНецелымПаллетымНаборки.ЯчейкаОтправитель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоЯчеекНаборки КАК КоличествоЯчеекНаборки
	|		ПО ВтДанныеНаборки.ИдентификаторУпаковкиПолучатель = КоличествоЯчеекНаборки.ИдентификаторУпаковкиПолучатель
	|			И ВтДанныеНаборки.ДокументОснование = КоличествоЯчеекНаборки.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКоличествоСтрокВПаллете КАК ВтКоличествоСтрокВПаллете
	|		ПО ВтДанныеНаборки.ИдентификаторУпаковкиПолучатель = ВтКоличествоСтрокВПаллете.ИдентификаторУпаковкиПолучатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПодготовленныеДанныеНаборки.ДокументОснование КАК ДокументОснование,
	|	ВтПодготовленныеДанныеНаборки.Номенклатура КАК Номенклатура,
	|	ВтПодготовленныеДанныеНаборки.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВтПодготовленныеДанныеНаборки.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	ВтПодготовленныеДанныеНаборки.итПризнакПомарочногоУчета КАК итПризнакПомарочногоУчета,
	|	ВтПодготовленныеДанныеНаборки.КоличествоНаПаллете КАК КоличествоНаПаллете,
	|	ВтПодготовленныеДанныеНаборки.КоличествоВСлое КАК КоличествоВСлое,
	|	ВтПодготовленныеДанныеНаборки.КоличествоВКоробе КАК КоличествоВКоробе,
	|	ВтПодготовленныеДанныеНаборки.КоличествоВнепаллетныхКоробов КАК КоличествоВнепаллетныхКоробов,
	|	ВЫБОР
	|		КОГДА ВтПодготовленныеДанныеНаборки.итПризнакПомарочногоУчета
	|			ТОГДА ВтПодготовленныеДанныеНаборки.КоличествоВнепаллетныхКоробов * &СтоимостьКоробаПМУ
	|		ИНАЧЕ ВтПодготовленныеДанныеНаборки.КоличествоВнепаллетныхКоробов * &СтоимостьКороба
	|	КОНЕЦ КАК СуммаКоробов,
	|	КоличествоПаллетНаборкиПоКоэф.КоэффициентПаллетНаборки * &СтоимостьПаллетыНаборки / ВтКоличествоСтрокНаборки.КоличествоСтрок КАК СуммаПосещения,
	|	ВЫБОР
	|		КОГДА ВтПодготовленныеДанныеНаборки.итПризнакПомарочногоУчета
	|			ТОГДА ВтПодготовленныеДанныеНаборки.КоличествоВнепаллетныхКоробов * &СтоимостьКоробаПМУ
	|		ИНАЧЕ ВтПодготовленныеДанныеНаборки.КоличествоВнепаллетныхКоробов * &СтоимостьКороба
	|	КОНЕЦ + КоличествоПаллетНаборкиПоКоэф.КоэффициентПаллетНаборки * &СтоимостьПаллетыНаборки / ВтКоличествоСтрокНаборки.КоличествоСтрок + ВЫБОР
	|		КОГДА ВтПодготовленныеДанныеНаборки.итПризнакПомарочногоУчета
	|			ТОГДА ВтПодготовленныеДанныеНаборки.КоличествоВнеКоробочныхБутылок * &СтоимостьБутылкиПМУНаборка
	|		ИНАЧЕ ВтПодготовленныеДанныеНаборки.КоличествоВнеКоробочныхБутылок * &СтоимостьБутылкиНаборка
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ВтПодготовленныеДанныеНаборки.Контрагент.ит_WMS_ВидСкладскойДеятельности = ЗНАЧЕНИЕ(Перечисление.ит_WMS_ВидыСкладскойДеятельности.Розничная)
	|			ТОГДА &СтоимостьНаборкиРозница / ЕСТЬNULL(ВтКоличествоСтрокНаборки.КоличествоСтрок, 1)
	|		ИНАЧЕ &СтоимостьНаборки / ЕСТЬNULL(ВтКоличествоСтрокНаборки.КоличествоСтрок, 1)
	|	КОНЕЦ + (ВтПодготовленныеДанныеНаборки.КоличествоЯчеекЗадачи - 1) * &СтоимостьЗаПосещениеЯчейкиНаборка * ВтПодготовленныеДанныеНаборки.КоэффициентЗадачи КАК Всего,
	|	ВтПодготовленныеДанныеНаборки.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
	|	ВтПодготовленныеДанныеНаборки.Контрагент КАК Контрагент,
	|	ВтПодготовленныеДанныеНаборки.КоэффициентЗадачи КАК КоэффициентЗадачи,
	|	ВтПодготовленныеДанныеНаборки.КоличествоВнеКоробочныхБутылок КАК КоличествоВнеКоробочныхБутылок,
	|	ВЫБОР
	|		КОГДА ВтПодготовленныеДанныеНаборки.итПризнакПомарочногоУчета
	|			ТОГДА ВтПодготовленныеДанныеНаборки.КоличествоВнеКоробочныхБутылок * &СтоимостьБутылкиПМУНаборка
	|		ИНАЧЕ ВтПодготовленныеДанныеНаборки.КоличествоВнеКоробочныхБутылок * &СтоимостьБутылкиНаборка
	|	КОНЕЦ КАК СуммаБутылок,
	|	ВЫБОР
	|		КОГДА ВтПодготовленныеДанныеНаборки.Контрагент.ит_WMS_ВидСкладскойДеятельности = ЗНАЧЕНИЕ(Перечисление.ит_WMS_ВидыСкладскойДеятельности.Розничная)
	|			ТОГДА &СтоимостьНаборкиРозница / ЕСТЬNULL(ВтКоличествоСтрокНаборки.КоличествоСтрок, 1)
	|		ИНАЧЕ &СтоимостьНаборки / ЕСТЬNULL(ВтКоличествоСтрокНаборки.КоличествоСтрок, 1)
	|	КОНЕЦ КАК СтоимостьДокумента,
	|	ВтПодготовленныеДанныеНаборки.КоэффициентПаллеты КАК КоэффициентПаллеты,
	|	ВтПодготовленныеДанныеНаборки.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
	|	ВтПодготовленныеДанныеНаборки.Количество КАК Количество,
	|	ВтПодготовленныеДанныеНаборки.ДатаОтгрузкиЗаказа КАК ДатаОтгрузкиЗаказа,
	|	ВтПодготовленныеДанныеНаборки.Заказ КАК Заказ
	|ПОМЕСТИТЬ ИтоговыеДанныеНаборок
	|ИЗ
	|	ВтПодготовленныеДанныеНаборки КАК ВтПодготовленныеДанныеНаборки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКоличествоСтрокНаборки КАК ВтКоличествоСтрокНаборки
	|		ПО ВтПодготовленныеДанныеНаборки.ДокументОснование = ВтКоличествоСтрокНаборки.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоПаллетНаборкиПоКоэф КАК КоличествоПаллетНаборкиПоКоэф
	|		ПО ВтПодготовленныеДанныеНаборки.ДокументОснование = КоличествоПаллетНаборкиПоКоэф.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговыеДанныеНаборок.ДокументОснование КАК ДокументОснование,
	|	СУММА(ИтоговыеДанныеНаборок.Всего) КАК Всего,
	|	ИтоговыеДанныеНаборок.ДатаОтгрузкиЗаказа КАК ДатаОтгрузкиЗаказа
	|ПОМЕСТИТЬ РассчетВсегоЗаЗаказ
	|ИЗ
	|	ИтоговыеДанныеНаборок КАК ИтоговыеДанныеНаборок
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтоговыеДанныеНаборок.ДокументОснование,
	|	ИтоговыеДанныеНаборок.ДатаОтгрузкиЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанныеНаборки.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ НаборкиКОтбору
	|ИЗ
	|	ВтДанныеНаборки КАК ВтДанныеНаборки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтДанныеНаборки.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итWMSПеремещениеТовары.Номенклатура КАК Номенклатура,
	|	итWMSПеремещениеТовары.Характеристика КАК Характеристика,
	|	итWMSПеремещениеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	итWMSПеремещениеТовары.Качество КАК Качество,
	|	итWMSПеремещениеТовары.ДатаРозлива КАК ДатаРозлива,
	|	итWMSПеремещениеТовары.Количество КАК Количество,
	|	итWMSПеремещениеТовары.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
	|	итWMSПеремещениеТовары.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
	|	ВложенныйЗапрос.Состояние КАК Состояние,
	|	итWMSПеремещениеТовары.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	итWMSПеремещениеТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	итWMSПеремещениеТовары.Ссылка КАК Ссылка,
	|	итWMSПеремещениеТовары.ЯчейкаОтправитель.Ярус КАК ЯчейкаОтправительЯрус,
	|	итWMSПеремещениеТовары.ЯчейкаПолучатель.Ярус КАК ЯчейкаПолучательЯрус,
	|	итWMSПеремещениеТовары.СерияНоменклатуры.итПризнакПомарочногоУчета КАК итПризнакПомарочногоУчета,
	|	итWMSПеремещениеТовары.Номенклатура.ЕдиницаХраненияОстатков.итКоличествоНаПаллете КАК итКоличествоНаПаллете,
	|	НаборкиКОтбору.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВтДанныеПеремещения
	|ИЗ
	|	НаборкиКОтбору КАК НаборкиКОтбору
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итWMSПеремещение.Товары КАК итWMSПеремещениеТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				итWMSСтрокиЗадачТСД.идСтроки КАК идСтроки,
	|				ВложенныйЗапрос.ИдЗадачи КАК ИдЗадачи,
	|				ВложенныйЗапрос.Состояние КАК Состояние,
	|				ВложенныйЗапрос.Ссылка КАК Ссылка
	|			ИЗ
	|				(ВЫБРАТЬ
	|					итWMSЗадачиТСД.ИдЗадачи КАК ИдЗадачи,
	|					итWMSЗадачиТСД.Состояние КАК Состояние,
	|					итWMSПеремещение.Ссылка КАК Ссылка
	|				ИЗ
	|					НаборкиКОтбору КАК НаборкиКОтбору
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итWMSПеремещение КАК итWMSПеремещение
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSЗадачиТСД КАК итWMSЗадачиТСД
	|							ПО итWMSПеремещение.Ссылка = итWMSЗадачиТСД.ДокументОснование
	|						ПО НаборкиКОтбору.ДокументОснование = итWMSПеремещение.итОснование
	|							И (итWMSПеремещение.ПеремещениеВПикинг)
	|				ГДЕ
	|					итWMSПеремещение.Ссылка.СтатусДокумента В (ЗНАЧЕНИЕ(перечисление.итwmsСтатусыСкладскихДокументов.Распределяется), ЗНАЧЕНИЕ(перечисление.итwmsСтатусыСкладскихДокументов.Распределен))
	|					И итWMSПеремещение.Ссылка.Проведен) КАК ВложенныйЗапрос
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSСтрокиЗадачТСД КАК итWMSСтрокиЗадачТСД
	|					ПО ВложенныйЗапрос.ИдЗадачи = итWMSСтрокиЗадачТСД.ИдЗадачи) КАК ВложенныйЗапрос
	|			ПО итWMSПеремещениеТовары.Ссылка = ВложенныйЗапрос.Ссылка
	|				И итWMSПеремещениеТовары.ИдентификаторСтроки = ВложенныйЗапрос.идСтроки
	|		ПО (итWMSПеремещениеТовары.Ссылка.ПеремещениеВПикинг)
	|			И НаборкиКОтбору.ДокументОснование = итWMSПеремещениеТовары.Ссылка.итОснование
	|ГДЕ
	|	итWMSПеремещениеТовары.Ссылка.СтатусДокумента В (ЗНАЧЕНИЕ(перечисление.итwmsСтатусыСкладскихДокументов.Зарезервирован), ЗНАЧЕНИЕ(перечисление.итwmsСтатусыСкладскихДокументов.Распределяется), ЗНАЧЕНИЕ(перечисление.итwmsСтатусыСкладскихДокументов.Распределен))
	|	И итWMSПеремещениеТовары.Ссылка.Проведен
	|	И ВЫБОР
	|			КОГДА итWMSПеремещениеТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Перечисление.итwmsСтатусыСкладскихдокументов.Зарезервирован)
	|				ТОГДА итWMSПеремещениеТовары.СостояниеЗадачи В (ЗНАЧЕНИЕ(Перечисление.итWMSСостоянияЗадачТСД.КВыполнению), ЗНАЧЕНИЕ(Перечисление.итWMSСостоянияЗадачТСД.ПустаяСсылка))
	|			ИНАЧЕ ЕСТЬNULL(ВложенныйЗапрос.Состояние, итWMSПеремещениеТовары.СостояниеЗадачи) В (ЗНАЧЕНИЕ(Перечисление.итWMSСостоянияЗадачТСД.КВыполнению), ЗНАЧЕНИЕ(Перечисление.итWMSСостоянияЗадачТСД.Выполняется))
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанныеПеремещения.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	ВтДанныеПеремещения.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
	|	ВтДанныеПеремещения.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтДанныеПеремещения.ИдентификаторСтроки) КАК КоличествоСтрок,
	|	ВтДанныеПеремещения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СтрокВЗадаче
	|ИЗ
	|	ВтДанныеПеремещения КАК ВтДанныеПеремещения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтДанныеПеремещения.ИдентификаторУпаковки,
	|	ВтДанныеПеремещения.ЯчейкаОтправитель,
	|	ВтДанныеПеремещения.ЯчейкаПолучатель,
	|	ВтДанныеПеремещения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанныеПеремещения.Номенклатура КАК Номенклатура,
	|	ВтДанныеПеремещения.Характеристика КАК Характеристика,
	|	ВтДанныеПеремещения.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВтДанныеПеремещения.Качество КАК Качество,
	|	ВтДанныеПеремещения.ДатаРозлива КАК ДатаРозлива,
	|	ВтДанныеПеремещения.Количество КАК Количество,
	|	ВтДанныеПеремещения.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
	|	ВтДанныеПеремещения.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
	|	ВтДанныеПеремещения.Состояние КАК Состояние,
	|	ВтДанныеПеремещения.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	ВтДанныеПеремещения.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВтДанныеПеремещения.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВтДанныеПеремещения.ЯчейкаОтправительЯрус <> ""1""
	|				И ВтДанныеПеремещения.ЯчейкаОтправительЯрус <> ""0""
	|				И ВтДанныеПеремещения.ЯчейкаОтправительЯрус <> ""00""
	|				И ВтДанныеПеремещения.ЯчейкаОтправительЯрус <> """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ / СтрокВЗадаче.КоличествоСтрок * &СтоимостьСпуска КАК Спуск,
	|	ВЫБОР
	|		КОГДА ВтДанныеПеремещения.ЯчейкаПолучательЯрус <> ""1""
	|				И ВтДанныеПеремещения.ЯчейкаПолучательЯрус <> ""0""
	|				И ВтДанныеПеремещения.ЯчейкаПолучательЯрус <> ""00""
	|				И ВтДанныеПеремещения.ЯчейкаПолучательЯрус <> """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ / СтрокВЗадаче.КоличествоСтрок * &СтоимостьПодъема КАК Подъем,
	|	ВЫБОР
	|		КОГДА ВтДанныеПеремещения.итПризнакПомарочногоУчета
	|				И ВтДанныеПеремещения.Количество < ВтДанныеПеремещения.итКоличествоНаПаллете
	|			ТОГДА 1 / СтрокВЗадаче.КоличествоСтрок * &СтоимостьПМУПеремещения
	|		ИНАЧЕ 1 / СтрокВЗадаче.КоличествоСтрок * &СтоимостьПеремещения
	|	КОНЕЦ КАК Перемещение,
	|	ВЫБОР
	|		КОГДА ВтДанныеПеремещения.ЯчейкаОтправительЯрус <> ""1""
	|				И ВтДанныеПеремещения.ЯчейкаОтправительЯрус <> ""0""
	|				И ВтДанныеПеремещения.ЯчейкаОтправительЯрус <> ""00""
	|				И ВтДанныеПеремещения.ЯчейкаОтправительЯрус <> """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ / СтрокВЗадаче.КоличествоСтрок * &СтоимостьСпуска + ВЫБОР
	|		КОГДА ВтДанныеПеремещения.ЯчейкаПолучательЯрус <> ""1""
	|				И ВтДанныеПеремещения.ЯчейкаПолучательЯрус <> ""0""
	|				И ВтДанныеПеремещения.ЯчейкаПолучательЯрус <> ""00""
	|				И ВтДанныеПеремещения.ЯчейкаПолучательЯрус <> """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ / СтрокВЗадаче.КоличествоСтрок * &СтоимостьПодъема + ВЫБОР
	|		КОГДА ВтДанныеПеремещения.итПризнакПомарочногоУчета
	|				И ВтДанныеПеремещения.Количество < ВтДанныеПеремещения.итКоличествоНаПаллете
	|			ТОГДА 1 / СтрокВЗадаче.КоличествоСтрок * &СтоимостьПМУПеремещения
	|		ИНАЧЕ 1 / СтрокВЗадаче.КоличествоСтрок * &СтоимостьПеремещения
	|	КОНЕЦ КАК Всего,
	|	ВтДанныеПеремещения.ДокументОснование КАК Наборка
	|ПОМЕСТИТЬ ВтПеремещениеПодготовленныеДанные
	|ИЗ
	|	ВтДанныеПеремещения КАК ВтДанныеПеремещения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтрокВЗадаче КАК СтрокВЗадаче
	|		ПО ВтДанныеПеремещения.Ссылка = СтрокВЗадаче.Ссылка
	|			И ВтДанныеПеремещения.ИдентификаторУпаковки = СтрокВЗадаче.ИдентификаторУпаковки
	|			И ВтДанныеПеремещения.ЯчейкаОтправитель = СтрокВЗадаче.ЯчейкаОтправитель
	|			И ВтДанныеПеремещения.ЯчейкаПолучатель = СтрокВЗадаче.ЯчейкаПолучатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПеремещениеПодготовленныеДанные.Наборка КАК Наборка,
	|	ВтПеремещениеПодготовленныеДанные.Ссылка КАК Ссылка,
	|	СУММА(ВтПеремещениеПодготовленныеДанные.Всего) КАК Всего
	|ПОМЕСТИТЬ ИтогоПоПеремещению
	|ИЗ
	|	ВтПеремещениеПодготовленныеДанные КАК ВтПеремещениеПодготовленныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтПеремещениеПодготовленныеДанные.Наборка,
	|	ВтПеремещениеПодготовленныеДанные.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РассчетВсегоЗаЗаказ.ДокументОснование КАК ДокументОснование,
	|	ВЫРАЗИТЬ(РассчетВсегоЗаЗаказ.Всего + ЕСТЬNULL(ИтогоПоПеремещению.Всего, 0) КАК ЧИСЛО(15, 0)) КАК Всего,
	|	РассчетВсегоЗаЗаказ.ДатаОтгрузкиЗаказа КАК ДатаОтгрузкиЗаказа,
	|	ДОБАВИТЬКДАТЕ(РассчетВсегоЗаЗаказ.ДатаОтгрузкиЗаказа, СЕКУНДА, -(РассчетВсегоЗаЗаказ.Всего + ЕСТЬNULL(ИтогоПоПеремещению.Всего, 0))) КАК ДатаОтгрузкиЗаМинусомВремениНабора,
	|	РАЗНОСТЬДАТ(&ДатаТекущая, ДОБАВИТЬКДАТЕ(РассчетВсегоЗаЗаказ.ДатаОтгрузкиЗаказа, СЕКУНДА, -(РассчетВсегоЗаЗаказ.Всего + ЕСТЬNULL(ИтогоПоПеремещению.Всего, 0))), ЧАС) КАК ДоОтгрузкиСУчетомВремениНаборки,
	|	ДОБАВИТЬКДАТЕ(&ДатаТекущая, СЕКУНДА, РассчетВсегоЗаЗаказ.Всего + ЕСТЬNULL(ИтогоПоПеремещению.Всего, 0)) КАК ПланируемаяДатаЗавершенияДокумента,
	|	НЕ ИтогоПоПеремещению.Ссылка ЕСТЬ NULL КАК НеВыполненноеПеремещение
	|ИЗ
	|	РассчетВсегоЗаЗаказ КАК РассчетВсегоЗаЗаказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоПоПеремещению КАК ИтогоПоПеремещению
	|		ПО РассчетВсегоЗаЗаказ.ДокументОснование = ИтогоПоПеремещению.Наборка
	|ГДЕ
	|	РАЗНОСТЬДАТ(&ДатаТекущая, ДОБАВИТЬКДАТЕ(РассчетВсегоЗаЗаказ.ДатаОтгрузкиЗаказа, СЕКУНДА, -РассчетВсегоЗаЗаказ.Всего), ЧАС) <= 8";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	
	Запрос.УстановитьПараметр("ДатаТекущая",ДатаТекущая);
	Запрос.УстановитьПараметр("СтоимостьБутылкиНаборка", Значение.СтоимостьБутылкиНаборка);
	Запрос.УстановитьПараметр("СтоимостьБутылкиПМУНаборка", Значение.СтоимостьБутылкиПМУНаборка);
	Запрос.УстановитьПараметр("СтоимостьКороба", Значение.СтоимостьКороба);
	Запрос.УстановитьПараметр("СтоимостьКоробаПМУ", Значение.СтоимостьКоробаПМУ);
	Запрос.УстановитьПараметр("СтоимостьНаборки", Значение.СтоимостьНаборки);
	Запрос.УстановитьПараметр("СтоимостьЗаПосещениеЯчейкиНаборка",Значение.СтоимостьЗаПосещениеЯчейкиНаборка);
	Запрос.УстановитьПараметр("СтоимостьНаборкиРозница", Значение.СтоимостьНаборкиРозница);
	Запрос.УстановитьПараметр("СтоимостьПаллетыНаборки", Значение.СтоимостьПаллетыНаборки);
	
	Запрос.УстановитьПараметр("СтоимостьСпуска", Значение.СтоимостьСпуска);
	Запрос.УстановитьПараметр("СтоимостьПодъема",Значение.СтоимостьПодъема);
	Запрос.УстановитьПараметр("СтоимостьПМУПеремещения", Значение.СтоимостьПеремещенияПМУ);
	Запрос.УстановитьПараметр("СтоимостьПеремещения", Значение.СтоимостьПеремещения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка=РезультатЗапроса.Выбрать();
	ИтогоЖелтый=0;
	ИтогоКрасный=0;
	СчетчикЖелтый=0;
	СчетчикКрасный=0;
	ТекущийСчетчик=0;
	Макет=ПолучитьМакет("СветофорНаборка");
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДоОтгрузкиСУчетомВремениНаборки >6 и  Выборка.ДоОтгрузкиСУчетомВремениНаборки <=8 Тогда
			СтрокаЖелтый=Макет.ПолучитьОбласть("СтрокаЖелтый");
			СтрокаЖелтый.Параметры.ДокументОснование=Выборка.ДокументОснование;
			СтрокаЖелтый.Параметры.ДатаОтгрузкиЗаказа=Выборка.ДатаОтгрузкиЗаказа;
			СтрокаЖелтый.Параметры.ПланируемаяДатаЗавершенияДокумента=Выборка.ПланируемаяДатаЗавершенияДокумента;
			СтрокаЖелтый.Параметры.ДоОтгрузкиСУчетомВремениНаборкиЧас=Выборка.ДоОтгрузкиСУчетомВремениНаборки;
			СтрокаЖелтый.Параметры.ВремяНаОбработкуДокумента=Строка(Выборка.Всего)+"/"+Строка(Формат(Выборка.Всего/60,"ЧЦ=15"));
			СчетчикЖелтый=СчетчикЖелтый+1;
			ИтогоЖелтый=ИтогоЖелтый+Выборка.Всего/60;
			ТабличныйДокумент.Вывести(СтрокаЖелтый);
		иначе
			СчетчикКрасный=СчетчикКрасный+1;
			СтрокаКрасный=Макет.ПолучитьОбласть("СтрокаКрасный");
			СтрокаКрасный.Параметры.ДокументОснование=Выборка.ДокументОснование;
			СтрокаКрасный.Параметры.ДатаОтгрузкиЗаказа=Выборка.ДатаОтгрузкиЗаказа;
			СтрокаКрасный.Параметры.ПланируемаяДатаЗавершенияДокумента=Выборка.ПланируемаяДатаЗавершенияДокумента;
			СтрокаКрасный.Параметры.ДоОтгрузкиСУчетомВремениНаборкиЧас=Выборка.ДоОтгрузкиСУчетомВремениНаборки;
			СтрокаКрасный.Параметры.ВремяНаОбработкуДокумента=Строка(Выборка.Всего)+"/"+Строка(Формат(Выборка.Всего/60,"ЧЦ=15"));
			ИтогоКрасный=ИтогоКрасный+Выборка.Всего/60;
			ТабличныйДокумент.Вывести(СтрокаКрасный);
			
		КонецЕсли;	
	КонецЦикла;
	ОбластьИтог=Макет.ПолучитьОбласть("ОбластьИтого");
	ОбластьИтог.Параметры.ИтогЖелтый=СчетчикЖелтый;
	ОбластьИтог.Параметры.ИтогКрасный=СчетчикКрасный;
	ОбластьИтог.Параметры.ИтогоЖелтый=Формат(ИтогоЖелтый,"ЧЦ=15");
	ОбластьИтог.Параметры.ИтогоКрасный=Формат(ИтогоКрасный,"ЧЦ=15");

    ТабличныйДокумент.Вывести(ОбластьИтог);
 
КонецПроцедуры



Процедура СформироватьТабличныйДокументСветофораОтгрузка(КоличествоКрасныхОтгрузок=0,ТабличныйДокумент) Экспорт 
	ДатаТекущая=ТекущаяДата();
	ДатаНачала=ДатаТекущая-24*60*60;
	ДатаОкончания=ДатаТекущая+24*60*60;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.итВремяНачалаПогрузкиКакВремя > ЗаказПокупателя.итВремяЗавершенияПогрузкиКакВремя
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ, 1), ЧАС, ЧАС(ЗаказПокупателя.итВремяЗавершенияПогрузкиКакВремя)), МИНУТА, МИНУТА(ЗаказПокупателя.итВремяЗавершенияПогрузкиКакВремя))
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ЗаказПокупателя.ДатаОтгрузки, ЧАС, ЧАС(ЗаказПокупателя.итВремяЗавершенияПогрузкиКакВремя)), МИНУТА, МИНУТА(ЗаказПокупателя.итВремяЗавершенияПогрузкиКакВремя))
	|	КОНЕЦ КАК ДатаОтгрузки
	|ПОМЕСТИТЬ ВтДанныеЗаказов
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен
	|	И ЗаказПокупателя.ДатаОтгрузки МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗаказПокупателя.Выполнен
	|	И ЗаказПокупателя.итВремяНачалаПогрузкиКакВремя <> ЗаказПокупателя.итВремяЗавершенияПогрузкиКакВремя
	|	И НЕ ЗаказПокупателя.Отгружен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанныеЗаказов.Ссылка КАК Ссылка,
	|	ВтДанныеЗаказов.ДатаОтгрузки КАК ДатаОтгрузки,
	|	РАЗНОСТЬДАТ(ВтДанныеЗаказов.ДатаОтгрузки, &ДатаТекущая, МИНУТА) КАК ВремяОпоздания
	|ПОМЕСТИТЬ ВтДанныеПодготовка
	|ИЗ
	|	ВтДанныеЗаказов КАК ВтДанныеЗаказов
	|ГДЕ
	|	РАЗНОСТЬДАТ(ВтДанныеЗаказов.ДатаОтгрузки, &ДатаТекущая, МИНУТА) > 60
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(итМаршрутизацияДокументыПодбора.Ссылка, ВтДанныеПодготовка.Ссылка) КАК Ссылка,
	|	ВтДанныеПодготовка.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВтДанныеПодготовка.ВремяОпоздания КАК ВремяОпоздания
	|ИЗ
	|	ВтДанныеПодготовка КАК ВтДанныеПодготовка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Маршрутизация.ДокументыМаршрута КАК итМаршрутизацияДокументыПодбора
	|		ПО ВтДанныеПодготовка.Ссылка = итМаршрутизацияДокументыПодбора.Заказ
	|			И (итМаршрутизацияДокументыПодбора.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(итМаршрутизацияДокументыПодбора.Ссылка, ВтДанныеПодготовка.Ссылка),
	|	ВтДанныеПодготовка.ДатаОтгрузки,
	|	ВтДанныеПодготовка.ВремяОпоздания";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаТекущая",ДатаТекущая);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Макет=ПолучитьМакет("СветофорОтгрузка");
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	Пока Выборка.Следующий() Цикл
	ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.Заполнить(Выборка);
	ТабличныйДокумент.Вывести(ОбластьСтрока);
	КоличествоКрасныхОтгрузок=КоличествоКрасныхОтгрузок+1;	
	КонецЦикла;

	КонецПроцедуры
